TexasInstruments/f29h85x-mcal/drivers/Cdd_Dma/include/Cdd_Dma_Priv.h
/*********************************************************************************************************************
 *  COPYRIGHT
 *  ------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *
 *   TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 *   Copyright (c) 2026 Texas Instruments Incorporated
 *
 *   All rights reserved not granted herein.
 *
 *   Limited License.
 *
 *   Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 *   license under copyrights and patents it now or hereafter owns or controls to
 *   make, have made, use, import, offer to sell and sell ("Utilize") this software
 *   subject to the terms herein. With respect to the foregoing patent license,
 *   such license is granted solely to the extent that any such patent is necessary
 *   to Utilize the software alone. The patent license shall not apply to any
 *   combinations which include this software, other than combinations with devices
 *   manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 *   Redistributions must preserve existing copyright notices and reproduce this license
 *   (including the above copyright notice and the disclaimer and (if applicable) source
 *   code license limitations below) in the documentation and/or other materials provided
 *   with the distribution.
 *
 *   Redistribution and use in binary form, without modification, are permitted provided
 *   that the following conditions are met:
 *
 *   * No reverse engineering, decompilation, or disassembly of this software is
 *     permitted with respect to any software provided in binary form.
 *   * Any redistribution and use are licensed by TI for use only with TI Devices.
 *   * Nothing shall obligate TI to provide you with source code for the software
 *     licensed and provided to you in object code.
 *
 *   If software source code is provided to you, modification and redistribution of the
 *   source code are permitted provided that the following conditions are met:
 *
 *   * Any redistribution and use of the source code, including any resulting derivative
 *     works, are licensed by TI for use only with TI Devices.
 *   * Any redistribution and use of any object code compiled from the source code
 *     and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 *   Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 *   may be used to endorse or promote products derived from this software without
 *   specific prior written permission.
 *
 *   DISCLAIMER.
 *
 *   THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 *   WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 *   AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 *   LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 *   GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 *   CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *   (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 *   EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *  \endverbatim
 *  ------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------
 *  File:       Cdd_Dma_Priv.h
 *  Generator:  None
 *
 *  Description:   This file contains data structures and private function declarations of private
 *API's.
 *********************************************************************************************************************/
#ifndef CDD_DMA_PRIV_H
#define CDD_DMA_PRIV_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************************************************************
 * Header Files
 *********************************************************************************************************************/
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_rtdma.h"

/*********************************************************************************************************************
 * Version Check (if required)
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Preprocessor #define Constants
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/

/** \brief DMA Driver Object Structure */
typedef struct Cdd_Dma_DriverObjTag
{
    /** \brief 2D lookup table: [instance][channel] -> configuration array index
     *
     * - First dimension: DMA instance (0=RTDMA1, 1=RTDMA2)
     * - Second dimension: DMA channel (0=CH1, 1=CH2, ... 9=CH10)
     * - Value: Index into Cdd_Dma_ConfigPtr->chcfg[] array
     * - 0xFF indicates channel is not configured
     */
    uint8 channelindex[CDD_DMA_HW_INSTANCE_MAX][CDD_DMA_CHANNEL_MAX];
} Cdd_Dma_DriverObjType;

/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Exported Function Prototypes
 *********************************************************************************************************************/
/** \brief Initialize the driver object with channel lookup table and set configuration pointer
 *
 * \param[in]  CfgPtr Configuration pointer
 * \pre None
 * \post None
 * \return None
 * \retval None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_DrvObjInit(P2CONST(Cdd_Dma_ConfigType, AUTOMATIC, CDD_DMA_CONST) CfgPtr);

/** \brief Initializes the DMA HW instances
 * \pre None
 * \post None
 * \return None
 * \retval None
 *********************************************************************************************************************/
FUNC(Std_ReturnType, CDD_DMA_CODE) Cdd_Dma_HwUnitInit(void);

/** \brief Deinitialize the DMA HW instances
 * \pre None
 * \post None
 * \return None
 * \retval None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_HwUnitDeinit(void);

/** \brief Initializes the MPU Region
 *
 * \param[in]  MpuBaseAddress MPU base address
 * \param[in]  MpuRegionCfg  MPU Region configurations
 * \pre None
 * \post None
 * \return None
 * \retval None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_MpuRegionInit(uint32 MpuBaseAddress, Cdd_Dma_MpuRegionCfgType MpuRegionCfg);

/** \brief Sets the data size for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  DataSize Read data size
 * \param[in]  WrDataSize Write data size
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_SetDataSize(uint32 Base, Cdd_Dma_ChannelDataSizeType DataSize, Cdd_Dma_ChannelWrDataSizeType WrDataSize);

/** \brief Sets the modes for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  OneShotMode One-shot mode enable/disable
 * \param[in]  ContinuousMode Continuous mode enable/disable
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_SetMode(uint32 Base, Cdd_Dma_OneshotModeEnableType OneShotMode,
                Cdd_Dma_ContinuousModeEnableType ContinuousMode);

/** \brief Sets the interrupt mode for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  IntMode Interrupt mode (beginning or end of transfer)
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetInterruptMode(uint32 Base, Cdd_Dma_ChIntModeType IntMode);

