TexasInstruments/f29h85x-mcal/drivers/Cdd_Dma/include/Cdd_Dma_Priv.h
/** \brief Enables the interrupt for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  IntEnable Interrupt enable/disable
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetInterruptEnable(uint32 Base, Cdd_Dma_ChIntEnableType IntEnable);

/** \brief Sets the overflow interrupt mode for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  OvrflowIntEnable Overflow interrupt enable/disable
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetOverflowInterruptEnable(uint32 Base, Cdd_Dma_OvrflowIntEnableType OvrflowIntEnable);

/** \brief Sets peripheral event trigger enable/disable for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  PeripheralEvntTrigEnable Enable/disable peripheral event trigger
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_SetPeripheralEventTriggerEnable_Priv(uint32 Base, Cdd_Dma_PeriEvtTrigEnableType PeripheralEvntTrigEnable);

/** \brief Sets the peripheral event trigger source for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  PeripheralEventTrigSrc Peripheral event trigger source
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_SetPeripheralEventTriggerSource_Priv(uint32 Base, Cdd_Dma_PeriEvtTriggerSrcType PeripheralEventTrigSrc);

/** \brief Sets the transfer sizes for DMA channel : Burst size and Transfer size
 *
 * \param[in]  Base Channel base address
 * \param[in]  BurstSize Burst size
 * \param[in]  TransferSize Transfer size
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetTransferSize_Priv(uint32 Base, uint8 BurstSize, uint16 TransferSize);

/** \brief Sets the transfer source step for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  SrcBurstStep Source burst step
 * \param[in]  SrcTransferStep Source transfer step
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetTransferSrcStep_Priv(uint32 Base, sint16 SrcBurstStep, sint16 SrcTransferStep);

/** \brief Sets the transfer destination step for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  DestBurstStep Destination burst step
 * \param[in]  DestTransferStep Destination transfer step
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetTransferDestStep_Priv(uint32 Base, sint16 DestBurstStep, sint16 DestTransferStep);

/** \brief Sets the transfer source address for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  SrcAddress Source address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetTransferSrcAddress_Priv(uint32 Base, uint32 SrcAddress);

/** \brief Sets the transfer destination address for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  DestAddress Destination address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetTransferDestAddress_Priv(uint32 Base, uint32 DestAddress);

/** \brief Sets the transfer source wrap properties for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  SrcWrapSize Source wrap size
 * \param[in]  SrcWrapStep Source wrap step
 * \param[in]  SrcBegAddress Source beginning address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_SetTransferWrapSrc(uint32 Base, uint16 SrcWrapSize, sint16 SrcWrapStep, uint32 SrcBegAddress);

/** \brief Sets the transfer destination wrap properties for DMA channel
 *
 * \param[in]  Base Channel base address
 * \param[in]  DestWrapSize Destination wrap size
 * \param[in]  DestWrapStep Destination wrap step
 * \param[in]  DestBegAddress Destination beginning address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_SetTransferWrapDest(uint32 Base, uint16 DestWrapSize, sint16 DestWrapStep, uint32 DestBegAddress);

/** \brief Starts a DMA channel transfer
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_StartChannelTransfer_Priv(uint32 Base);

/** \brief Stops a DMA channel transfer
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_StopChannelTransfer_Priv(uint32 Base);

/** \brief Forces peripheral event trigger for DMA channel
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_ForcePeripheralEventTrigger_Priv(uint32 Base);

/** \brief Clears peripheral event trigger flag for DMA channel
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_ClearPeripheralEventTrigger_Priv(uint32 Base);

/** \brief Triggers soft reset for DMA channel
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_TriggerSoftReset_Priv(uint32 Base);

/** \brief Checks if peripheral event trigger is enabled
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return boolean TRUE if peripheral event trigger is enabled, FALSE otherwise
 *********************************************************************************************************************/
FUNC(boolean, CDD_DMA_CODE) Cdd_Dma_IsPeripheralEventTriggerEnabled(uint32 Base);

/** \brief Gets peripheral event trigger flag status
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return Cdd_Dma_PeriEvtTrigStatusType Peripheral event trigger flag status
 *********************************************************************************************************************/
FUNC(Cdd_Dma_PeriEvtTrigStatusType, CDD_DMA_CODE) Cdd_Dma_GetPeripheralEventTriggerFlag(uint32 Base);

/** \brief Gets transfer status flag
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return Cdd_Dma_TransferStatusType Transfer status flag
 *********************************************************************************************************************/
FUNC(Cdd_Dma_TransferStatusType, CDD_DMA_CODE) Cdd_Dma_GetTransferStatusFlag(uint32 Base);

/** \brief Gets burst status flag
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return Cdd_Dma_BurstStatusType Burst status flag
 *********************************************************************************************************************/
FUNC(Cdd_Dma_BurstStatusType, CDD_DMA_CODE) Cdd_Dma_GetBurstStatusFlag(uint32 Base);

/** \brief Gets run status flag
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return Cdd_Dma_RunStatusType Run status flag
 *********************************************************************************************************************/
FUNC(Cdd_Dma_RunStatusType, CDD_DMA_CODE) Cdd_Dma_GetRunStatusFlag(uint32 Base);

/** \brief Gets overflow status flag
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return Cdd_Dma_OverflowStatusType Overflow status flag
 *********************************************************************************************************************/
FUNC(Cdd_Dma_OverflowStatusType, CDD_DMA_CODE) Cdd_Dma_GetOverflowStatusFlag(uint32 Base);

/** \brief Sets error clear to clear error conditions
 *
 * \param[in]  Base Channel base address
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_ClearErrorFlag_Priv(uint32 Base);

/** \brief Updates channel priority by writing to SWPRI1 or SWPRI2 register
 *
 * This function updates the priority for a specific DMA channel by performing a read-modify-write operation on the
 *appropriate SWPRI register.
 * - Channels 1-8 use SWPRI1 register (4 bits per channel)
 * - Channels 9-10 use SWPRI2 register (4 bits per channel)
 *
 * \param[in]  ChannelId Symbolic name of the channel for which priority shall be set
 * \param[in]  Priority  Priority value to set
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_UpdateChannelPriority(VAR(uint8, AUTOMATIC) ChannelId, Cdd_Dma_ChannelPriority Priority);

/** \brief Finds the hardware instance index for a given DMA instance
 *
 * \param[in]  instance DMA instance type
 * \pre None
 * \post None
 * \return Hardware instance index
 *********************************************************************************************************************/
FUNC(uint8, CDD_DMA_CODE) Cdd_Dma_GetHwInstanceIndex(VAR(Cdd_Dma_InstanceType, AUTOMATIC) instance);

/** \brief Checks if DMA hardware instance configuration is committed for a given channel
 *
 * \param[in]  ChannelId Channel identifier
 * \pre None
 * \post None
 * \return Status of DMA hardware instance configuration commit
 * \retval TRUE: DMA hardware instance configuration is committed
 * \retval FALSE: DMA hardware instance configuration is not committed
 *********************************************************************************************************************/
FUNC(boolean, CDD_DMA_CODE) Cdd_Dma_IsHwInstanceCommittedForChannel(VAR(uint8, AUTOMATIC) ChannelId);

/** \brief Sets DMA configuration commit (permanent lock) for a specific DMA instance
 *
 * \param[in] HwInstanceId Hardware instance index
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetDmaCfgCommit_Priv(VAR(uint8, AUTOMATIC) HwInstanceId);

