TexasInstruments/f29h85x-mcal/drivers/Cdd_Dma/include/Cdd_Dma_Priv.h
/** \brief Sets channel configuration commit (permanent lock) for a specific channel
 *
 * \param[in] ChannelId Channel configuration index
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetChannelCommit_Priv(VAR(uint8, AUTOMATIC) ChannelId);

/** \brief Sets MPU configuration commit (permanent lock) for a specific DMA instance
 *
 * \param[in] HwInstanceId Hardware instance index
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_SetMpuCfgCommit_Priv(VAR(uint8, AUTOMATIC) HwInstanceId);

/** \brief Sets MPU region configuration commit (permanent lock) for a specific DMA MPU region
 *
 * \param[in] HwInstanceId Hardware instance index
 * \param[in] MpuRegionIdx MPU region index within the instance
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE)
Cdd_Dma_SetMpuRegionCommit_Priv(VAR(uint8, AUTOMATIC) HwInstanceId, VAR(uint8, AUTOMATIC) MpuRegionIdx);

/** \brief ISR function called by a specific interrupt
 *
 * This ISR call the notification function if enabled for the channel
 *
 * \param[in]  InstanceId DMA instance
 * \param[in]  ChannelId DMA channel
 * \pre Cdd_Dma_Init must be called before this function
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_ProcessIsr(Cdd_Dma_InstanceType InstanceId, Cdd_Dma_ChannelType ChannelId);

#if (STD_ON == CDD_DMA_LOCK_CONFIGURATION)
/** \brief Locks DMA Channel configurations
 *
 * \param[in]  Base Base address of the DMA Channel
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_ChConfigLockConfiguration(uint32 Base);

/** \brief Unlocks DMA Channel configurations
 *
 * \param[in]  Base Base address of the DMA Channel
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_ChConfigUnlockConfiguration(uint32 Base);

/** \brief Locks all DMA Channel configurations
 *
 * \pre None
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_DMA_CODE) Cdd_Dma_ChConfigLockConfigurationAll(void);
#endif

/** \brief Checks whether channel configurations are committed for a DMA channel
 *
 * \param[in] Base : Base address of the DMA channel
 * \pre None
 * \post None
 * \return Status of DMA channel configurations commit
 * \retval TRUE: DMA channel configurations committed
 * \retval FALSE: DMA channel configurations not committed
 *********************************************************************************************************************/
FUNC(boolean, CDD_DMA_CODE) Cdd_Dma_CheckChannelConfigCommit(uint32 Base);

/** \brief Checks whether DMA configurations are committed for a hardware instance
 *
 * \param[in] Base : Base address of the hardware instance
 * \pre None
 * \post None
 * \return Status of DMA instance configurations commit
 * \retval TRUE: DMA instance configurations committed
 * \retval FALSE: DMA instance configurations not committed
 *********************************************************************************************************************/
FUNC(boolean, CDD_DMA_CODE) Cdd_Dma_CheckConfigurationCommit(uint32 Base);

/** \brief Checks whether MPU instance configurations are committed for a DMA MPU instance
 *
 * \param[in] Base : Base address of the DMA MPU instance
 * \pre None
 * \post None
 * \return Status of DMA MPU instance configurations commit
 * \retval TRUE: DMA MPU instance configurations committed
 * \retval FALSE: DMA MPU instance configurations not committed
 *********************************************************************************************************************/
FUNC(boolean, CDD_DMA_CODE) Cdd_Dma_CheckMpuConfigCommit(uint32 Base);

/** \brief Checks whether MPU region configurations are committed for a DMA MPU region
 *
 * \param[in] Base : Base address of the DMA MPU
 * \param[in] MpuRegion : DMA MPU Region
 * \pre None
 * \post None
 * \return Status of DMA MPU region configurations commit
 * \retval TRUE: DMA MPU region configurations committed
 * \retval FALSE: DMA MPU region configurations not committed
 *********************************************************************************************************************/
FUNC(boolean, CDD_DMA_CODE) Cdd_Dma_CheckMpuRegionCommit(uint32 Base, Cdd_Dma_MpuRegionType MpuRegion);
/*********************************************************************************************************************
 *  Exported Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* CDD_DMA_PRIV_H */
/*********************************************************************************************************************
 *  End of File: Cdd_Dma_Priv.h
 *********************************************************************************************************************/
